# 연습: DataFrame 1

In [3]:
#판다스를 가져오기
import pandas as pd

### 예제 1 
1. Nan이 아닌 부분을 출력하시오.
2. NaN의 값을 0으로 바꾼후 출력하시오.

In [7]:
sdata = {'Ohio': 35000,
         'Texas': 71000,
         'Oregon': 16000,
         'Utah': 5000}

states = ['California', 'Ohio', 'Oregon', 'Texas'] #california is not in sdata
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [15]:
# 예제 1.1
df= pd.DataFrame(obj4)
df_not_Nan = df.dropna()
df_not_Nan

              0
Ohio    35000.0
Oregon  16000.0
Texas   71000.0

In [33]:
# 예제 1.2
df= pd.DataFrame(obj4)
df.iloc[0,0] = 0
df

                  0
California      0.0
Ohio        35000.0
Oregon      16000.0
Texas       71000.0

### 예제 2

index가 'four'인 행의 값을 [1999, 'Ohio', 3.2, 0]으로 변경하시오.

`columns=['year', 'state', 'pop', 'debt']`

In [160]:
# 예제 2
data=[]

frame = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], #debt는 없으므로 NaN으로 채움
                   index=['one', 'two', 'three', 'four', 'five']) #index를 지정해줌

frame

frame.loc['four']=[1999, 'Ohio', 3.2, 0]
frame

       year state  pop debt
one     NaN   NaN  NaN  NaN
two     NaN   NaN  NaN  NaN
three   NaN   NaN  NaN  NaN
four   1999  Ohio  3.2    0
five    NaN   NaN  NaN  NaN

### 예제 3
위 frame에서 index가 two, column이 state 인 값을 'Nevada'로 변경하시오.

In [55]:
# 예제 3
frame.loc['two','state']="Nevada"
frame

         year   state  pop  debt
one       NaN     NaN  NaN   NaN
two       NaN  Nevada  NaN   NaN
three     NaN     NaN  NaN   NaN
four   1999.0    Ohio  3.2   0.0
five      NaN     NaN  NaN   NaN

### 예제 4 
위 frame에 year=2002이고 state='Ohio' 일때 True를 갖는 etc 컬럼을 생성하시오.

In [59]:
frame['etc'] = round(['year']==2002 and ['state'] =='Ohio', True)
frame

         year   state  pop  debt  etc
one       NaN     NaN  NaN   NaN    0
two       NaN  Nevada  NaN   NaN    0
three     NaN     NaN  NaN   NaN    0
four   1999.0    Ohio  3.2   0.0    0
five      NaN     NaN  NaN   NaN    0

### 예제 5 
1. 위 frame에서 one, three, four 행에서 year, state, etc 열만 가져와 frame2에 저장하시오.
2. 수정된 frame2에서 year > 2000, state == Ohio 인 행을 출력 하시오.

In [73]:
# 예제 5.1

frame2 = frame.loc[['one','three','four'],['year','state','etc']]
frame2

         year state  etc
one       NaN   NaN    0
three     NaN   NaN    0
four   1999.0  Ohio    0

In [75]:
# 예제 5.2
frame2.loc[(frame2['year'] > 2000) & (['state']=='Ohio')]

Empty DataFrame
Columns: [year, state, etc]
Index: []

### 예제 6 
데이터 프레임의 각 행과 열의 합을 각각 계산하여 출력하시오.

In [81]:
import numpy as np

frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), #bde 열을 생성
                  index=['Utah', 'Ohio', 'Texas', 'Oregon']) #Utah, Ohio, Texas, Oregon 행을 생성
frame

               b         d         e
Utah    1.102897 -0.726648 -0.516096
Ohio   -0.699176 -2.649606  0.403895
Texas   0.125177  0.265245 -0.121354
Oregon -0.141759  0.168430  1.040340

In [91]:
# 예제 6:열의 합
frame.sum()

b    0.387138
d   -2.942579
e    0.806784
dtype: float64

In [89]:
# 예제 6: 행의 합
frame.sum(axis='columns')

Utah     -0.139847
Ohio     -2.944887
Texas     0.269067
Oregon    1.067011
dtype: float64

### 예제 7
아래 int_frame을 index, column기준으로 정렬하시오. (단, index, column 모두 정렬되어야 함)<br>

In [145]:
int_frame = pd.DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'b', 'c', 'a']) #column 기준 정렬
int_frame

       d  b  c  a
three  0  1  2  3
one    4  5  6  7

In [147]:
# 예제 7
int_frame = int_frame[['a','b','c','d']]
int_frame

       a  b  c  d
three  3  1  2  0
one    7  5  6  4

In [151]:
int_frame = int_frame.loc[['one','three'],:]
int_frame

       a  b  c  d
one    7  5  6  4
three  3  1  2  0

### 예제 8
코스피와 IBM 가격정보를 불러와 상관관계를 파악하시오.
- 코스피 = '^KS11'
- IBM = 'IBM'
- 애플 = 'APLE'

# 주가 데이터를 불러올 티커 목록
tickers = ['^KS11', 'IBM', 'AAPL', 'GOOGL', 'MSFT', 'TSLA']  # AAPL: 애플, GOOGL: 구글, MSFT: 마이크로소프트, TSLA: 테슬라

In [194]:
!pip install pandas_datareader
!pip install yfinance

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas_datareader in c:\users\윤선정\appdata\roaming\python\python312\site-packages (0.10.0)
Requirement already satisfied: lxml in c:\programdata\anaconda3\lib\site-packages (from pandas_datareader) (5.2.1)
Requirement already satisfied: pandas>=0.23 in c:\programdata\anaconda3\lib\site-packages (from pandas_datareader) (2.2.2)
Requirement already satisfied: requests>=2.19.0 in c:\programdata\anaconda3\lib\site-packages (from pandas_datareader) (2.32.2)
Requirement already satisfied: numpy>=1.26.0 in c:\programdata\anaconda3\lib\site-packages (from pandas>=0.23->pandas_datareader) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas>=0.23->pandas_datareader) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas>=0.23->pandas_datareader) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\programdata\anaconda3\lib\site-packages (from pandas>=0.23->pandas_datareader) (2023.3)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.19.0->pandas_datareader) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.19.0->pandas_datareader) (3.7)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.19.0->pandas_datareader) (2.2.2)
Requirement already satisfied: certifi>=2017.4.17 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.19.0->pandas_datareader) (2024.8.30)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas>=0.23->pandas_datareader) (1.16.0)
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: yfinance in c:\users\윤선정\appdata\roaming\python\python312\site-packages (0.2.46)
Requirement already satisfied: pandas>=1.3.0 in c:\programdata\anaconda3\lib\site-packages (from yfinance) (2.2.2)
Requirement already satisfied: numpy>=1.16.5 in c:\programdata\anaconda3\lib\site-packages (from yfinance) (1.26.4)
Requirement already satisfied: requests>=2.31 in c:\programdata\anaconda3\lib\site-packages (from yfinance) (2.32.2)
Requirement already satisfied: multitasking>=0.0.7 in c:\users\윤선정\appdata\roaming\python\python312\site-packages (from yfinance) (0.0.11)
Requirement already satisfied: lxml>=4.9.1 in c:\programdata\anaconda3\lib\site-packages (from yfinance) (5.2.1)
Requirement already satisfied: platformdirs>=2.0.0 in c:\programdata\anaconda3\lib\site-packages (from yfinance) (3.10.0)
Requirement already satisfied: pytz>=2022.5 in c:\programdata\anaconda3\lib\site-packages (from yfinance) (2024.1)
Requirement already satisfied: frozendict>=2.3.4 in c:\programdata\anaconda3\lib\site-packages (from yfinance) (2.4.2)
Requirement already satisfied: peewee>=3.16.2 in c:\users\윤선정\appdata\roaming\python\python312\site-packages (from yfinance) (3.17.7)
Requirement already satisfied: beautifulsoup4>=4.11.1 in c:\programdata\anaconda3\lib\site-packages (from yfinance) (4.12.3)
Requirement already satisfied: html5lib>=1.1 in c:\users\윤선정\appdata\roaming\python\python312\site-packages (from yfinance) (1.1)
Requirement already satisfied: soupsieve>1.2 in c:\programdata\anaconda3\lib\site-packages (from beautifulsoup4>=4.11.1->yfinance) (2.5)
Requirement already satisfied: six>=1.9 in c:\programdata\anaconda3\lib\site-packages (from html5lib>=1.1->yfinance) (1.16.0)
Requirement already satisfied: webencodings in c:\programdata\anaconda3\lib\site-packages (from html5lib>=1.1->yfinance) (0.5.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas>=1.3.0->yfinance) (2.9.0.post0)
Requirement already satisfied: tzdata>=2022.7 in c:\programdata\anaconda3\lib\site-packages (from pandas>=1.3.0->yfinance) (2023.3)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (3.7)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (2.2.2)
Requirement already satisfied: certifi>=2017.4.17 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (2024.8.30)

# 예제 8
#from pandas_datareader import data as web
#all_data = {}
#for ticker in ['^KS11', 'IBM']:
#    all_data[ticker] = web.get_data_yahoo(ticker)

#price = DataFrame({tic: data['Adj Close']
#                for tic, data in all_data.items()})

import yfinance as yf
import pandas as pd

tickers = ['^KS11', 'IBM', 'AAPL', 'GOOGL', 'MSFT', 'TSLA']
all_data = {}

# Yahoo Finance 데이터를 가져옴
for ticker in tickers:
    all_data[ticker] = yf.download(ticker)

# 종가 데이터를 추출하여 DataFrame 생성
price = pd.DataFrame({tic: data['Adj Close'] for tic, data in all_data.items()})

# 상관계수 계산
print(price.corr())

price.corr()

In [182]:
!pip show yfinance

Name: yfinance
Version: 0.2.46
Summary: Download market data from Yahoo! Finance API
Home-page: https://github.com/ranaroussi/yfinance
Author: Ran Aroussi
Author-email: ran@aroussi.com
License: Apache
Location: C:\Users\윤선정\AppData\Roaming\Python\Python312\site-packages
Requires: beautifulsoup4, frozendict, html5lib, lxml, multitasking, numpy, pandas, peewee, platformdirs, pytz, requests
Required-by:

In [197]:
import yfinance as yf
import pandas as pd

tickers = ['^KS11', 'IBM', 'AAPL', 'GOOGL', 'MSFT', 'TSLA']
all_data = {}

# Yahoo Finance 데이터를 가져옴
for ticker in tickers:
    #all_data[ticker] = yf.download(ticker)
    data_temp = yf.download(ticker)
    print (data_temp.columns)
    
    if not data_temp.empty :
        data_temp.columns = data_temp.columns.droplevel(1)
        all_data[ticker] = data_temp

#all_data

# 종가 데이터를 추출하여 DataFrame 생성
price = pd.DataFrame({tic: data['Adj Close'] for tic, data in all_data.items()})
price

# 상관계수 계산
#print(price.corr())

price_corr = price.corr()
price_corr

ModuleNotFoundError: No module named 'yfinance'

### 예제 9
1. 2~3행에서 '0'컬럼을 None으로 변경 하시오.
2. 0~2행에서 '2'컬럼을 None으로 변경하시오.
3. 각 컬럼의 None값들을 각 컬럼의 평균값으로 채우시오.

In [ ]:
# 예제 9.1 2~3행에서 '0'컬럼을 None으로 변경 하시오.

In [ ]:
# 예제 9.2 0~2행에서 '2'컬럼을 None으로 변경하시오.

In [ ]:
# 예제 9.3 각 컬럼의 None값들을 각 컬럼의 평균값으로 채우시오.

### 예제 10
1. multi_idx 이름으로 0 ~ 20의 값을 갖는 (5,4) 데이터 프레임을 생성하시오.
  - index 상위 색인: a, a, b, b, c
  - index 하위 색인: 1,2, 1, 2, 1
  - columns 상위 색인: 'KOR', 'KOR', 'USA', 'USA'
  - columns 하위 색인: 'Seoul', 'Busan', 'LA', 'NewYork'
2. index=b, column= KOR의 Seoul에 해당하는 값을 출력하시오.

In [ ]:
# 예제 10.1

In [ ]:
# 예제 10.2

### 예제 11
1. 위 데이터프레임에 index(key1, key2), column(Country, Region)의 이름을 설정하시오.
2. 2번째 index로 데이터 프레임을 정렬 하시오.
3. column의 레벨을 바꾸시오.

In [ ]:
# 예제 11.1

In [ ]:
# 예제 11.2

In [ ]:
# 예제 11.3

---

In [ ]:
# end of file